# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/php'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'homebrew/dupes/grep'

# Install Binaries
# brew 'awscli'
brew 'git'
brew 'hub'
brew 'tree'
brew 'mackup'
# brew 'mas'
brew 'node'
# brew 'trash'
brew 'wget'
brew 'grunt'
brew 'bower'
brew 'postgresql'
brew 'ffmpeg'
brew 'imagemagick'
brew 'heroku'
brew 'python'

# Development
# brew 'php71', args: ['with-debug']
# brew 'php71-intl'
# brew 'mariadb'

# Apps
cask 'alfred'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'iterm2'
cask 'sublime-text'
cask 'transmit'
cask 'vlc'
cask 'things'
cask 'principle'
cask 'sketch'
cask 'skype'
cask 'jdownloader'
cask 'spotify'
cask 'handbrake'
cask 'nvalt'
cask 'torbrowser'
cask 'xld'
cask 'xee'
cask 'transmission'
cask 'cloak'
cask 'little-snitch'

# Utils
#cask --appdir="~/Applications/Utilities" 'carbon-copy-cloner'
cask 'hazel', args: { appdir: '~/Applications/Utilities' }
cask 'flux', args: { appdir: '~/Applications/Utilities' }
cask 'default-folder-x', args: { appdir: '~/Applications/Utilities' }
cask 'spectacle', args: { appdir: '~/Applications/Utilities' }
cask 'itsycal', args: { appdir: '~/Applications/Utilities' }
cask 'the-unarchiver', args: { appdir: '~/Applications/Utilities' }
cask 'bartender', args: { appdir: '~/Applications/Utilities' }
cask 'logitech-unifying', args: { appdir: '~/Applications/Utilities' }
# this failed: 
# cask 'karabiner', args: { appdir: '~/Applications/Utilities' }
cask 'itunes-volume-control', args: { appdir: '~/Applications/Utilities' }
cask 'xquartz', args: { appdir: '~/Applications/Utilities' }
# failed:
# cask 'heroku-toolbelt', args: { appdir: '~/Applications/Utilities' }

# Quicklook plugins
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'betterzipql'
cask 'qlimagesize'
cask 'webpquicklook'
# this failed:
# cask 'suspicious-package'
cask 'quicklookase'
cask 'qlvideo'

# Install Mac App Store apps -- might as well do this manually
# mas '1Password', id: 443987910
# mas 'DaisyDisk', id: 411643860
# mas 'Keynote', id: 409183694
# mas 'hazeover-distraction-dimmer', id: 430798174
